# Factbook SQL Queries

This notebook contains some practice exercises in SQL fundamentals using SQLite within Jupyter. The factbook.db file is sourced from the [CIA World Factbook](https://www.cia.gov/library/publications/the-world-factbook/).

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

## Query to return the tables present in the database

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

* sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

## Query to return the first 5 rows of the 'facts' table

In [4]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

* sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Query to return the min/max of 'population' and 'population_growth'

In [5]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts;

* sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

## Query to return the country with min population

In [6]:
%%sql
SELECT name, population
  FROM facts
 WHERE population = (SELECT MIN(population)
                       FROM facts
                    );

* sqlite:///factbook.db
Done.

[('Antarctica', 0)]

## Query to return the country with max population
Returns 'World' from the 'name' column, which is clearly the total world population.

In [7]:
%%sql
SELECT name, population
  FROM facts
 WHERE population = (SELECT MAX(population)
                       FROM facts
                    );

* sqlite:///factbook.db
Done.

[('World', 7256490011)]

## Query to return min/max in 'population' and 'population_growth' while excluding Antartica and World

In [8]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts
 WHERE name != 'Antarctica'
   AND name != 'World';

* sqlite:///factbook.db
Done.

[(48, 1367485388, 0.0, 4.02)]

## Query to return average of 'population' and 'area', again excluding Antartica and World

In [9]:
%%sql
SELECT AVG(population), AVG(area)
  FROM facts
 WHERE name != 'Antarctica'
   AND name != 'World';

* sqlite:///factbook.db
Done.

[(32377011.0125, 555093.546184739)]

## Query to find countries whose populations are above average and areas are below average

In [10]:
%%sql
SELECT name
  FROM facts
 WHERE population > (SELECT AVG(population)
                       FROM facts
                      WHERE name != 'Antarctica'
                        AND name != 'World'
                    )
   AND area < (SELECT AVG(area)
                 FROM facts
                WHERE name != 'Antarctica'
                  AND name != 'World'
              );

* sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]